In [1]:
import pandas as pd
import numpy as np

In [2]:
file1 = pd.read_csv('file1.csv')
file2 = pd.read_csv('file2.csv')
file3 = pd.read_csv('file3.csv')
file1.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [3]:
file1.shape

(4008, 11)

In [4]:
file2.shape

(996, 11)

In [5]:
file3.shape

(7070, 11)

In [6]:
#Rearrange the columns in the dataframe as needed
file3 = file3.rename(columns={'State':'ST',
                            'Gender':'GENDER'})
file2 = file2[['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount']]
file3 = file3[['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount']]

In [7]:
data = pd.concat([file1, file2, file3], axis=0)
data.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [8]:
numerical = data.select_dtypes(['int64','float64'])

In [9]:
categorical = data.select_dtypes(['object'])

In [10]:
data = data.drop(['Education','Number of Open Complaints'], 1)

/var/folders/1_/tj8gsc8n4r3fnt406bzys4s40000gn/T/ipykernel_44895/287011401.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  data = data.drop(['Education','Number of Open Complaints'], 1)

In [11]:
data['Customer Lifetime Value'].head()

0            NaN
1     697953.59%
2    1288743.17%
3     764586.18%
4     536307.65%
Name: Customer Lifetime Value, dtype: object

In [12]:
#Correct the values in the column customer lifetime value.
#They are given as a percent, so multiply them by 100 and change dtype to numerical type.
#The data don't have values for this specific variable for 2944 rows!
#I will replace nan values
#data[data['Customer Lifetime Value'].isna()==True]
#data['Customer Lifetime Value'].value_counts(dropna=False)
data['Customer Lifetime Value'] = data['Customer Lifetime Value'].fillna(0.0)
data['Customer Lifetime Value'].value_counts(dropna=False)

0.000000        2944
4984.618655        6
25464.820590       6
5246.278375        6
22332.439460       6
                ...
7477.176362        1
15700.284360       1
2968.077571        1
5452.171237        1
2611.836866        1
Name: Customer Lifetime Value, Length: 8212, dtype: int64

In [13]:
#now, to work better with this column I will turn all the data into numeric
data['Customer Lifetime Value'] = pd.to_numeric(data['Customer Lifetime Value'], errors='coerce')
data['Customer Lifetime Value'].value_counts(dropna=False)

0.000000       2944
NaN            2060
5555.830205       6
6366.225775       6
3237.996209       6
               ...
4928.001408       1
4896.261605       1
2483.642397       1
5207.197499       1
2611.836866       1
Name: Customer Lifetime Value, Length: 6290, dtype: int64

In [14]:
#now I'm ending up with more nan values... I will clear assign them, again, the 0.0, but I know I'm losing information
#and that probably I'm doing a poor job with this data...I'm just tired!
data['Customer Lifetime Value'] = data['Customer Lifetime Value'].fillna(0.0)
data['Customer Lifetime Value'].value_counts(dropna=False)

0.000000       5004
2659.705650       6
5568.947534       6
4686.469674       6
9095.049868       6
               ...
8759.592518       1
4928.001408       1
4896.261605       1
2483.642397       1
2611.836866       1
Name: Customer Lifetime Value, Length: 6289, dtype: int64

In [15]:
#now, I'm not sure why and if this is right, but I will follow the requested and multiply all this column by 100
data['Customer Lifetime Value'] = data['Customer Lifetime Value'] * 100

In [19]:
data['Customer Lifetime Value'] = data['Customer Lifetime Value'].round(2)
data['Customer Lifetime Value']

0             0.00
1             0.00
2             0.00
3             0.00
4             0.00
           ...
7065    2340598.80
7066     309651.12
7067     816389.04
7068     752444.24
7069     261183.69
Name: Customer Lifetime Value, Length: 12074, dtype: float64

In [20]:
data = data.drop_duplicates()

In [21]:
data[data['Income']<= 0]

,Customer,ST,GENDER,Customer Lifetime Value,Income,Monthly Premium Auto,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,0.00,0.0,1000.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,0.00,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
3,WW63253,California,M,0.00,0.0,106.0,Corporate Auto,SUV,529.881344
7,CF85061,Arizona,M,0.00,0.0,101.0,Corporate Auto,Four-Door Car,363.029680
10,SX51350,California,M,0.00,0.0,67.0,Personal Auto,Four-Door Car,482.400000
...,...,...,...,...,...,...,...,...,...
7059,WZ45103,California,F,567805.02,0.0,76.0,Personal Auto,Four-Door Car,364.800000
7061,RX91025,California,M,1987226.20,0.0,185.0,Personal Auto,SUV,1950.725547
7062,AC13887,California,M,462899.53,0.0,67.0,Corporate Auto,Two-Door Car,482.400000
7067,TD14365,California,M,816389.04,0.0,85.0,Corporate Auto,Four-Door Car,790.784983
7069,Y167826,California,M,261183.69,0.0,77.0,Corporate Auto,Two-Door Car,369.600000